const PrivacyPage = () => {
  return (
    <div>
      <pre>
        {`
  WACHU 개인정보 처리방침
  
  1. 개인정보의 수집 및 이용 목적
  WACHU는 소셜 로그인(OAuth)을 통해 사용자로부터 개인정보를 수집하며, 이는 서비스 제공 및 이용자 식별을 위해 사용됩니다.
  
  2. 수집하는 개인정보의 항목
  WACHU는 소셜 로그인을 통해 다음과 같은 개인정보를 수집합니다:
  
  - 이름, 이메일 주소, 프로필 사진 등 소셜 로그인 제공자가 제공하는 정보
  
  3. 개인정보의 보유 및 이용 기간
  WACHU는 수집된 개인정보를 5년 동안 보유하며, 이후 해당 정보를 파기합니다. 단, 법령에 따라 보존이 필요한 경우에는 해당 기간 동안 보관할 수 있습니다.
  
  4. 개인정보의 파기 절차 및 방법
  보유 기간이 종료된 개인정보는 지체 없이 파기됩니다. 파기는 안전한 방식으로 이루어지며, 파기된 정보는 복구할 수 없습니다.
  
  5. 개인정보 보호책임자
  개인정보와 관련된 문의사항은 아래의 개인정보 보호책임자에게 연락 주시기 바랍니다.
  
  - 이름: 노재원
  - 이메일: opqw987@gmail.com
  
  6. 개인정보 처리방침 변경
  본 개인정보 처리방침은 법령 및 WACHU의 정책에 따라 변경될 수 있으며, 변경 사항은 사전 고지 후 시행됩니다.
          `}
      </pre>
    </div>
  );
};

export default PrivacyPage;
