const TermsPage = () => {
  return (
    <div>
      <pre>
        {`
    WACHU 테스트 서비스 이용약관
    
    제 1 조 (목적)
    이 약관은 WACHU(이하 "회사")가 제공하는 테스트 서비스(이하 "서비스")의 이용과 관련하여 
    회사와 이용자 간의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.
    
    제 2 조 (서비스의 제공 및 이용 기간)
    1. 회사는 이용자에게 2024년 8월 22일까지 서비스를 제공합니다.
    2. 서비스는 테스트 목적을 위해 제공되며, 상업적 목적이 아닌 이용자 피드백 수집 및 
       서비스 개선을 위해 진행됩니다.
    3. 회사는 서비스의 종료일인 2024년 8월 22일 이후, 서비스 제공을 중단하며, 이용자의 
       서비스 접근 권한도 종료됩니다.
    
    제 3 조 (서비스 내용 및 변경)
    1. 회사는 서비스의 내용, 사용 방법 및 서비스 이용에 필요한 정보를 회사의 웹사이트 
       또는 서비스 내에 공지하여 이용자가 알 수 있도록 합니다.
    2. 회사는 필요한 경우 서비스의 내용을 변경할 수 있으며, 이 경우 변경 사항을 사전에 
       공지합니다.
    
    제 4 조 (개인정보의 수집 및 이용)
    1. 회사는 서비스 제공을 위해 필요한 최소한의 개인정보를 수집합니다.
    2. 수집된 개인정보는 오직 서비스 제공과 관련된 목적으로만 사용되며, 서비스 종료일인 
       2024년 8월 22일 이후 모든 개인정보는 파기됩니다.
    
    제 5 조 (이용자의 의무)
    1. 이용자는 본 약관 및 관련 법령을 준수하며, 회사가 제공하는 서비스의 정상적인 운영을 
       방해해서는 안 됩니다.
    2. 이용자는 서비스 사용 시 허위 정보를 제공하거나 타인의 정보를 무단으로 사용해서는 
       안 됩니다.
    
    제 6 조 (서비스 중단 및 면책사항)
    1. 회사는 천재지변, 기술적 문제 등 불가피한 사유로 인해 서비스를 중단할 수 있으며, 이 
       경우 회사는 사전에 고지합니다.
    2. 본 서비스는 테스트 목적으로 제공되므로, 회사는 서비스 이용으로 인해 발생한 어떠한 
       문제에 대해서도 법적 책임을 지지 않습니다.
    
    제 7 조 (기타 사항)
    1. 이 약관에 명시되지 않은 사항에 대해서는 관계 법령 및 상관례에 따릅니다.
    2. 본 약관은 2024년 8월 22일까지 유효하며, 서비스 종료와 함께 효력이 자동으로 종료됩니다.
            `}
      </pre>
    </div>
  );
};

export default TermsPage;
